<main class="page">
  <h1 class="page-title mb-10">เกี่ยวกับเรา</h1>

  <h2>เราคือใคร</h2>
  <p>
    Crack 'n' Code Thailand เป็นกลุ่มนักเรียนคอมพิวเตอร์โอลิมปิกวิชาการ
    (ค่ายสสวท.)
    ที่ต้องการสร้างพื้นที่ออนไลน์เพื่อให้นักเรียนที่มีความสนใจด้านการแข่งขันคอมพิวเตอร์โอลิมปิกได้ฝึกฝน
    และพัฒนาความสามารถของตนเอง
    ให้มีความสามารถในการแก้ไขปัญหาเชิงคอมพิวเตอร์ได้ดีขึ้น
  </p>

  <h2>ประสบการณ์ของเรา</h2>
  <p>
    การแข่งขัน Crack 'n' Code ครั้งแรกเกิดขึ้นในเดือนกรกฎาคม ปี 2021
    ซึ่งได้ผ่านมาแล้วเป็นเวลากว่า 10 เดือน เราได้จัดการแข่งขันไปแล้วทั้งหมด 11
    ครั้ง และมีโจทย์กว่า 38 ข้อ เป้าหมายของเราคือการสร้างพื้นที่ให้ทุก ๆ
    คนได้เข้ามาร่วมสนุก และฝึกฝนตนเอง
  </p>

  <h2>หมายเหตุ</h2>
  <p class="mb-3">
    พวกเรา<span class="font-bold text-red-600">ไม่ใช่</span
    >คณะผู้จัดส่งผู้แทนโอลิมปิกวิชาการ
    และมิได้มีส่วนเกี่ยวข้องกับองค์กรที่เกี่ยวกับโอลิมปิกวิชาการ (เช่น สอวน.
    หรือ สสวท.) โดยตรง
  </p>
  <p>
    พวกเราเป็นแค่กลุ่มนักเรียนคอมพิวเตอร์โอลิมปิกวิชาการ
    ที่อยากช่วยพัฒนาความก้าวหน้าวงการคอมพิวเตอร์โอลิมปิกวิชาการในไทย
  </p>
</main>

<style lang="postcss">
  h2 {
    @apply text-2xl font-bold;
  }

  p {
    @apply text-xl my-4;
  }
</style>
