<main class="text-center w-2/3 mx-auto">
  <h1 class="text-6xl font-bold mb-10">Crack 'n' Code Pre TOI18</h1>

  <h2>เราคือใคร</h2>
  <p>
    Crack 'n' Code Thailand เป็นกลุ่มนักเรียนโอลิมปิกวิชาการคอมพิวเตอร์
    (ค่ายสสวท.)
    ที่ต้องการสร้างพื้นที่ออนไลน์เพื่อให้นักเรียนที่มีความสนใจด้านการแข่งขันคอมพิวเตอร์โอลิมปิกได้ฝึกฝน
    และพัฒนาความสามารถของตนเอง
    ให้มีความสามารถในการแก้ไขปัญหาเชิงคอมพิวเตอร์ได้ดีขึ้น
  </p>

  <h2>การแข่งขัน Pre-TOI 18</h2>
  <p>
    จะจัดขึ้นในวันที่ 28-29 พฤษภาคม 2565 ผ่านระบบ CMS
    ซึ่งเป็นระบบเดียวกับที่ใช้ในการแข่งขันคอมพิวเตอร์โอลิมปิกระหว่างประเทศ (IOI)
    และการสอบคัดเลือกในค่ายสสวท
  </p>
</main>

<style lang="postcss">
  h2 {
    @apply text-4xl font-bold;
  }

  p {
    @apply text-3xl my-4;
  }
</style>
