<script lang="ts">
  import ext from "$lib/ext";
</script>

<main class="page">
  <h1 class="text-5xl sm:text-6xl font-bold mb-10">กฎการแข่งขัน Pre TOI18</h1>

  <ul class="list-disc text-left w-2/3 mx-auto">
    <li>
      การแข่งขันจะจัดขึ้นในวันที่ 28 และ 29 พฤษภาคม 2565 ในเวลา 19:00 - 22:00
    </li>
    <li>ในแต่ละวัน จะมีโจทย์วันละ 3 ข้อ แต่ละข้อมีคะแนนเท่ากันที่ 100 คะแนน</li>
    <li>
      โจทย์ในรอบนี้จะเป็นการรับ input จาก stdin และส่ง output ทาง stdout
      เท่านั้น (หรือเป็นวิธีเดียวกับการแข่งขันโอลิมปิกระดับชาติในปีที่ผ่าน ๆ มา)
    </li>
    <li>
      เนื้อหาโจทย์จะออกตามเนื้อหาที่ออกสอบในการแข่งขันคอมพิวเตอร์โอลิมปิกระดับชาติ
      (TOI)
      <a
        class="blue-link"
        href="https://toi2020.kku.ac.th/index.php?r=user-about-contest%2Fcontent-scope"
        {...ext}
      >
        เนื้อหาและข้อกำหนดของ TOI
      </a>
    </li>
    <li>
      รองรับการส่งด้วยภาษา C (gnu11) และ C++ (gnu++17) เท่านั้น (เกรดเดอร์ใช้
      gcc เวอร์ชั่น 9.4 บน Ubuntu 20.04)
    </li>
    <li>
      แต่ละข้อสามารถส่งได้ 50 ครั้ง แต่ละครั้งต้องเว้นช่วงอย่างน้อย 45
      วินาทีในแต่ละข้อ
    </li>
    <li>
      การให้คะแนนในแต่ละข้ออาจจะใช้วิธีที่แตกต่างกัน
      ซึ่งอาจจะไม่ใช่วิธีเดียวกับวิธีให้คะแนนของการแข่งขัน TOI18
      ผู้เข้าแข่งขันควรตรวจสอบกติกากับเจ้าภาพ
    </li>
    <li>
      ขอความร่วมมือผู้เข้าแข่งขันทำโจทย์ด้วยตนเอง ไม่กระทำการทุจริต
      เพื่อความสนุกของการแข่งขัน
    </li>
    <li>
      อาจจะมีการเพิ่มชุดทดสอบระหว่างสอบหรือหลังสอบ
      ในกรณีระหว่างสอบเรารับประกันว่าจะไม่มีการเพิ่มชุดทดสอบใน 30
      นาทีสุดท้ายของการแข่งขัน ในกรณีที่เพิ่มหลังการสอบ
      เรารับประกันว่าคะแนนของคุณจะไม่หายเกิน 50% (กฎ 50%
      เป็นกฎที่ใช้ในการสอบคัดเลือกของค่ายสสวท.)
    </li>
  </ul>
</main>

<style lang="postcss">
  li {
    @apply text-xl xl:text-2xl my-2;
  }
</style>
