<main class="text-center w-2/3 mx-auto">
  <h1 class="text-6xl font-bold mb-10">กฏการแข่งขัน Pre TOI18</h1>

  <ul class="list-disc text-left w-2/3 mx-auto">
    <li>
      การแข่งขันจะจัดขึ้นในวันที่ 28 และ 29 พฤษภาคม 2565 ในเวลา 19:00 - 22:00
    </li>
    <li>ในแต่ละวัน จะมีโจทย์วันละ 3 ข้อ แต่ละข้อมีคะแนนเท่ากันที่ 100 คะแนน</li>
    <li>
      โจทย์ในรอบนี้จะเป็นการรับ input จาก stdin และส่ง output ทาง stdout
      เท่านั้น (หรือเป็นวิธีเดียวกับการแข่งขันโอลิมปิกระดับชาติในปีที่ผ่าน ๆ มา)
    </li>
    <li>
      เนื้อหาโจทย์จะออกตามเนื้อหาที่ออกสอบในการแข่งขันคอมพิวเตอร์โอลิมปิกระดับชาติ
      (TOI)
    </li>
    <li>รองรับการส่งด้วยภาษา C (C11) C++ (C++11) เท่านั้น</li>
    <li>
      แต่ละข้อสามารถส่งได้ 50 ครั้ง แต่ละครั้งต้องเว้นช่วงอย่างน้อย 45
      วินาทีในแต่ละข้อ
    </li>
  </ul>
</main>

<style lang="postcss">
  li {
    @apply text-2xl my-2;
  }

  p {
    @apply text-3xl my-4;
  }
</style>
