<script lang="ts">
  import ext from "$lib/ext";
</script>

<main class="page">
  <h1 class="page-title mb-10">กฎการแข่งขัน Pre TOI18</h1>

  <ul class="list-disc text-left rwidth pl-8 pr-4 lg:px-0 mx-auto">
    <li>
      การแข่งขันจะจัดขึ้นในวันที่ 28 และ 29 พฤษภาคม 2565 ในเวลา 19:00 - 22:00
    </li>
    <li>ในแต่ละวัน จะมีโจทย์วันละ 3 ข้อ แต่ละข้อมีคะแนนเท่ากันที่ 100 คะแนน</li>
    <li>
      โจทย์ในรอบนี้จะเป็นการรับ input จาก stdin และส่ง output ทาง stdout
      เท่านั้น (หรือเป็นวิธีเดียวกับการแข่งขันโอลิมปิกระดับชาติในปีที่ผ่าน ๆ มา)
    </li>
    <li>
      เนื้อหาโจทย์จะออกตามเนื้อหาที่ออกสอบในการแข่งขันคอมพิวเตอร์โอลิมปิกระดับชาติ
      (TOI)
      <a
        class="blue-link"
        href="https://toi18.science.cmu.ac.th/scope"
        {...ext}
      >
        ขอบเขตเนื้อหาของ TOI18
      </a>
    </li>
    <li>
      รองรับการส่งด้วยภาษา C (gnu11) และ C++ (gnu++14) เท่านั้น
      ซึ่งเป็นการตั้งค่าเดียวกันกับการแข่งขัน TOI18 (<a
        class="blue-link"
        href="https://toi18.science.cmu.ac.th/systemrequirements"
        {...ext}>อ้างอิง</a
      >) ทั้งนี้เวอร์ชั่นของ gcc
      และระบบปฏิบัติการที่เกรดเดอร์ใช้จะแตกต่างจากการแข่งขัน TOI18
      โดยทางเราจะใช้ gcc เวอร์ชั่น 9.4 บน Ubuntu 20.04
      ซึ่งไม่ได้มีความแตกต่างมาก คำสั่งที่ใช้ในการคอมไพล์จะถูกแจ้งใน CMS
    </li>
    <li>
      แต่ละข้อสามารถส่งได้ 50 ครั้ง แต่ละครั้งต้องเว้นช่วงอย่างน้อย 45
      วินาทีในแต่ละข้อ <b>ข้อจำกัดนี้อาจจะไม่มีในการแข่งขัน TOI18</b>
    </li>
    <li>
      การให้คะแนนในการแข่งขันครั้งนี้ ใช้วิธีเดียวกับการแข่งขันระหว่างประเทศ
      (IOI) และการคัดเลือกภายในค่าย สสวท.
      นั่นคือผลรวมของคะแนนในแต่ละปัญหาย่อยที่ดีที่สุดจากทุกการส่ง
      วิธีการให้คะแนนนี้จะเป็นหนึ่งในรูปแบบการให้คะแนนของ TOI18
      แนะนำให้ผู้เข้าแข่งขัน TOI18 อ่าน<a
        class="blue-link"
        href="https://toi18.science.cmu.ac.th/criterion/"
        {...ext}>เกณฑ์การให้คะแนนของ TOI18</a
      > เพื่อทราบอีกรูปแบบของการให้คะแนน
    </li>
    <li>
      ขอความร่วมมือผู้เข้าแข่งขันทำโจทย์ด้วยตนเอง ไม่กระทำการทุจริต
      เพื่อความสนุกของการแข่งขัน
    </li>
    <li>
      อาจจะมีการเพิ่มชุดทดสอบระหว่างสอบหรือหลังสอบ
      ในกรณีระหว่างสอบเรารับประกันว่าจะไม่มีการเพิ่มชุดทดสอบในชั่วโมงสุดท้ายของการแข่งขัน
      ในกรณีที่เพิ่มหลังการสอบ เรารับประกันว่าคะแนนของคุณจะไม่หายเกิน 50% (กฎ
      50% เป็นกฎที่ใช้ในการสอบคัดเลือกของค่ายสสวท.)
    </li>
  </ul>
</main>

<style lang="postcss">
  li {
    @apply text-xl xl:text-2xl my-2;
  }
</style>
